<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Avogadro2 installer</string>
    <key>Identifier</key>
    <string>com.github.dcoobs-recipes.download.Avogadro2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Avogadro</string>
        <key>URL</key>
        <string>https://www.openchemistry.org/downloads/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.openchemistry.org/downloads</string>
                <key>re_pattern</key>
                <string>href=\"(https.*?Avogadro.*?\.dmg)\"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
