<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Malwarebytes Breach Remediation-Graphical User Interface DMG, and imports into Munki.
    
Modified version of dataJAR recipe (https://github.com/autopkg/dataJAR-recipes/tree/master/Malwarebytes%20Breach%20Remediation-Command%20Line%20Interface)</string>
    <key>Identifier</key>
    <string>com.github.dcoobs-recipes.munki.Malwarebytes Breach Remediation-Graphical User Interface</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Malwarebytes Breach Remediation-Graphical User Interface</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Malwarebytes Breach Remediation is designed to allow business users to detect and remove malware from endpoints. It is built upon the power of our Malwarebytes Anti-Malware anti-malware client.

Implementation in a portable form provides increased flexibility for IT staff to quickly and easily deploy the client, detect and remediate threats, gather activity logs, and continue with their daily tasks – all with a minimal investment in time and resources.</string>
            <key>developer</key>
            <string>Malwarebytes</string>
            <key>display_name</key>
            <string>Malwarebytes Breach Remediation</string>
            <key>maximum_os_version</key>
            <string>10.14.6</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>ParentRecipe</key>
    <string>com.github.dcoobs-recipes.download.Malwarebytes Breach Remediation-Graphical User Interface</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unzip/</string>                                 
                </array>
            </dict>
        </dict> 
    </array>
</dict>
</plist>
